{"keras_version": "2.0.4", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "unroll": false, "implementation": 0, "kernel_constraint": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "name": "lstm_1", "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 50, "recurrent_dropout": 0.0, "dtype": "float32", "use_bias": true, "dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_constraint": null, "batch_input_shape": [2, 2, 300]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "unit_forget_bias": true, "recurrent_regularizer": null, "unroll": false, "implementation": 0, "kernel_constraint": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "name": "lstm_2", "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 35, "recurrent_dropout": 0.0, "dtype": "float32", "use_bias": true, "dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "bias_constraint": null, "batch_input_shape": [2, 2, 300]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_3"}}], "backend": "tensorflow"}